; TaskSwitchXP Pro 2.05 Hungarian Language File
; Translated by Péter Zsolt <zsolti_net@programozo.hu>
; My first name is Zsolt
; My surname is Péter


; TaskSwitchXP enumerates all *.LNG files into .\lang subfolder!
; To add a language for TaskSwitchXP:
;     1) translate this file;
;     2) save it as <NewLanguage>.lng in UNICODE format
;        (for Notepad: select File->Save_As and then choose Unicode encoding);
;     3) test it before submitting!!!
;
; Translations forum/tracker: http://www.ntwind.com/forum/viewforum.php?f=3
;
; I will include some translations to my official release (if you accept!)...
; Please put your e-mail address for feedback somewhere!


; There are a few special characters (two symbols are recognized as one):
;     1) carriage return and new line:  \r\n
;     2) tab:  \t
;     3) quotation mark:  \"
;     4) back slash:  \\


; NOTE: These language files will generally work with future versions of 
;       TaskSwitchXP, but some strings will appear in English. I will put a 
;       change log for future versions in the comments of this file.


; Currently TaskSwitchXP uses *.LNG file names for language identifying.
; This string is ignored. Please put here for future versions:
;     19999="English_LanguageName (Native_LanguageName)"
;     e.g. 19999="German (Deutsch)"
19999="English"


; Cofiguration
20000="TaskSwitchXP Pro 2.0 beállítások"
20001="Oxi"
20002="Mégsem"
20003="Alkalmaz"

; Filters
20031="TaskSwitchXP konfigurációs akták (*.cfg)"


; Pages
20050="Általános"
20051="Megjelenés"
20052="Alkalmazás lista"
20053="Előnézet"
20054="Alkalmazás info"
20055="Forró kulcsok"
20056="Kizárások"
20057="Haladó"
20058="Névjegy"

; Page descriptions
20070="Általános beállítások"
20071="Megjelenés beállításai"
20072="Alkalmazás lista"
20073="Előnézet beállításai"
20074="Alkalmazás info"
20075="TaskSwitchXP forró kulcsok"
20076="TaskSwitchXP kizárások"
20077="Haladó beállítások"
20078="TaskSwitchXP névjegye"


; General page
20100="Nyelv:"
20101="<a id=\"idLang\" href=\"\">További fordítások keresése...</a>"
20102="Használj minden rendszerben lévő felhasználóhoz saját beállításokat"
20103="TaskSwitchXP indítása rendszerindításkor"
20104="Magas prioritás beállítása a TaskSwitchXP-hez"
20105="Ms PowerToy TaskSwitcher futásának ellenőrzése"
20106="Tálcaikonok:"
20107="TaskSwitchXP ikon megjelenítése a tálcán induláskor"
20108="Egyéni ikon használata:"
20109="Ablakok kis méretűvé alakítása a jobb gombbal kattintva"
20110="TSXP tálcaikonok távol tartása a WinXP auto-elrejtés jellemzőből"
20111="Lekicsinytett ablak hozzáadása az Alt-Tab lista végéhez"

20120="Alapértelmezés beállítása"
20121="Betöltés..."
20122="Mentés..."

; Appearance page
20200="Pozíció a képernyőn:"
20201="Megjelenítés az aktív figyelőn"
20202="TaskSwitchXP ablak árnyékolása"
20203="TaskSwitchXP ablak áttetszőségének engedélyezése:"
20204="Animáció előtűnés engedélyezése (millimásodpercekben):"
20205="Animáció eltűnés engédélyezése (millimásodpercekben):"
20206="Rajz-módok előnybe részesítése:"
20207="XP Vizuális stílus:"
20208="Klasszikus stílus:"
20209="TaskSwitchXP klasszikus stílus kényszerített használata"
20210="Bal-jobb mező elrendezés"

; Position on screen
20270="Felül - Bal oldalon"
20271="Felül - Középen"
20272="Felül - Jobb oldalon"
20273="Középen - Bal oldalon"
20274="Középre zárt"
20275="Középen - Jobb oldalon"
20276="Alul - Bal oldalon"
20277="Alul - Középen"
20278="Alul - Jobb oldalon"

; Modern XP skins
20280="Panel stílus indítása (alapértelmezett)"
20281="PowerToy TaskSwitcher stílus"
20282="Egyszerű ablak stílus"
20283="Lapos XP stílus"
20284="Lágy XP stílus"
20285="TaskBar stílus"

; Classical skins
20290="Panel stílus indítása (alapértelmezett)"
20291="Lapos panel stílus indítása"


; Task List page
20300="Lista nézet:"
20301="Oszlopok száma:"
20302="Szélesség (pixelben):"
20303="Sorok száma:"
20304="Kis ikonok"
20305="Eszköztippek engedélyezése az ikonlistához"
20306="Kéz kurzor engedélyezése a kiválasztott elemen"
; or something like 20307="Enable mouse over selection", 
; I've translated it to Russian as: 20307="Select list item under cursor"
20307="Kurzor alatti elem kiválasztása"
20308="Megfordított egér görgő"
20309="Kiválasztás stílusa:"
20310="Fókusz rajzolása a téglalap köré"
20311="Szöveg típusa és színe:"
20312="Betűtípus:"
20313="Méret:"
20314="F"
20315="D"
20316="Szín index:"

; List views
20390="Ikonok"
20391="Függőleges lista"

; Selection styles
20380="Keret"
20381="Kitöltött téglalap"
20382="Lekerekített téglalap"

; Color indexes
20370="Egyszerű szöveg"
20371="Kijelölt szöveg"
20372="Kijelölés háttere"
20373="1. megjelölt szöveg"
20374="1. megjelölt háttér"
20375="2. megjelölt szöveg"
20376="2. megjelölt háttér"


; Preview page
20400="Stílus előnézete:"
20401="\"Asztal\" stílus előnézete"
20402="\"Ablak\" stílus előnézete"
20403="Ablak taskbar bevétele az előnézeti képbe"
20404="Csak a legutolsó alkalmazás előugró ablakának rajzolása"
20405="Ne rajzold az asztal hátterét előnézetben (régi v1.0 stílus)"
20406="Ablakháttér rajzolása háttérként"
20407="Szegény rajzolása az előnézeti kép köré"
20408="Előnézeti kép középre helyezése függőlegesen"
20409="Lekicsinyített ablak feliratok megjelenítése az előnézetben (*)"
20410="Minden rétegezett ablak kitárása az előnézetből (*)"
20411="Előnézeti kép szélessége (pixelben):"
20412="Első előnézeti kép generálásának késleltetáse (millimásodpercben):"
20413="Ne rejtsd el az előnézeti képeket"
20414="Előnézet élő frissítésébek engedélyezése (millimásodpercekben):"


; Info page
20500="Felirat mező:"
20501="Betűtípus:"
20502="Méret:"
20503="F"
20504="D"
20505="Szín:"
20506="Árnyék rajzolása:"
20507="Mély:"
20508="Szín:"
20509="Alkalmazás ikon megjelenítése a felirat mezőben"
20510="Kis felirat mező használata"
20511="Infó mező:"
20512="Betűtípus:"
20513="Méret:"
20514="F"
20515="D"
20516="Szín:"
20517="Árnyék rajzolása:"
20518="Mély:"
20519="Szín:"
20520="Magasság:"
20521="Formátum:"

; Info formats
20590="Nincs"
20591="Csak az alkalmazás száma"
20592="Folyamat ID"
20593="Folyamat neve"
20594="Folyamat neve  [PID]"
20595="Program leírása"


; Hotkeys page
20600="Lecseréli a hagyományos Windows Alt-Tab folyamatkapcsolót"
20601="Engedélyezi a folyamatkapcsolást a Ctrl+Alt+[Shift]+Tab lenyomásával"
; or something like 20602="Don't hide TaskSwitchXP window on Alt releasing"
20602="Ne rejtse el a TaskSwitchXP ablakot az Alt billenytyű felengedésekor"
; or something like 20603="Use low-level method to replace Alt-Tab"
20603="Alacsony szintű hurok használata az Alt+Tab cseréjéhez"
20604="TaskSwitchXP vezérlés:"
20605="Alkalmazások listája:"
20606="Példák listája:"
20607="TaskSwitchXP konfigurálása:"
20608="Rendszer tálcaikon megjelenítése/elrejtése:"
20609="TaskSwitchXP bezárása:"
20610="További forró kulcsok:"
20611="Lekicsinyítés a tálcára:"
20612="Visszaállítás a tálcáról:"


; Exclusions page
20700="Új..."
20701="Szerkeszt..."
20702="Törlés"

; List groups
20780="Előnézet rajzolása"
20781="Ablak felsorolása"

20790="Név"
20791="Paraméterek"

; Advanced page
20800="Ablak címek:"
20801="Fő alkalmazás ablakok feliratainak használata"
20802="Haladó interfész beállítások:"
20803="Felirat mező törlése"
20804="Információs mező törlése"
20805="Tálcaikon akciók:"
20806="Kontextus menü:"
20807="Kialakítás:"
20808="Alkalmazások listája:"
20809="Példák listája:"
20810="Kialakító beállításai:"
20811="Konfigurációs ablak megjelenítése mindíg legfelül"
20812="Emlékezzen a konfigurációs ablak pozíciójára"
20813="Emlékezzen az utolsó konfigurációs oldalra"
20814="TaskSwitchXP indítása az indítás/bezáráson"

; Tray icon actions
20890="Nincs"
20891="Bal gomb kattintás"
20892="Bal gomb dupla kattintás"
20893="Középső gomb kattintás"
20894="Középső gomb dupla kattintás"
20895="Jobb gomb kattintás"
20896="Jobb gomb dupla kattintás"


; About page

; Information about you: contact email, website, etc.
; PLEASE NO COMMERCIAL ADS, ONLY YOUR PERSONAL INFORMATION!!!
;
; You can place here a text with two links in HTML format:
;   1) <a id=\"idTranslatorHome\" href=\"http://www.ntwind.com\">homepage</a>
;   2) <a id=\"idTranslatorMail\" href=\"mailto:alexander@ntwind.com">e-mail</a>
; Don't forget about special characters (like as \" and \\) in HTML tags, and 
; check out your links!
;
; You can also place here a salutation for TaskSwitchXP users!  ;)

20900="Fordította <a id=\"idTranslatorMail\" href=\"mailto:zsolti_net@programozo.hu\">Péter Zsolt</a>...\r\n1983. febr. 5-én született 23 éves programozó vagyok, ez a hobbim :-)"


; Exclusions dialog
22000="TaskSwitchXP kizárás"
22001="Oxi"
22002="Mégsem"
22003="Aktív alkalmazások:"
22004="Frissítés"
22005="Kizárás neve:"
22006="Kizárás ezáltal:"
22007="Folyamat neve:"
22008="Ablakosztály:"
22009="Ablak címsora:"
22010="Kizárás ettől:"
22011="Rajzolás előnézete"
22012="Ablak felsorolás"
22013="Engedélyezett"

22090="" ; not excluded
22091=">> kizárva az előnézetből"
22092=">> kizárva a felsorolásból"

; Configurator Errors
30000="TaskSwitchXP konfigurációs hiba"
30002="Nem sikerült elindítani a TaskSwitchXP.exe aktát! Kérlek ellenőrizd TaskSwitchXP telepítést."
30003="Nem lettek elmentve a változtatások a regisztrációs adatbázisba. Kérlek ellenőrizd a hozzáférésed."
30004="Nem sikerül betölteni a beállításokat aktából."
30005="Nem sikerült betölteni a beállításokat. Alab beállítások lettek visszaállítva."
30006="Nem sikerült aktába menteni a beállításokat."

; Hints for exclusion dialog
30100="Névtelen kirekesztés"
30101="Kérlek írj elő egy nevet a kizáráshoz."
30102="Nincsenek paraméterek"
30103="Kérlek írj elő néhány parmétert a kizáráshoz."
30104="Nincs folyamat név"
30105="Kérlek írj elő egy folyamat nevet."
30106="Nincs ablak osztály"
30107="Kérlek írj elő egy ablak osztályt."

; Confirmations
30900="TaskSwitchXP megerősítés"
30901="A TaskSwitchXP többszörös indítást érzékelt rendszeren.\r\nValóban szeretnéd engedélyezni \"Ablak\" az előnézeti módot, hogy minden előnézetet mutasson a másodlagos monitor is?"

; TaskSwitchXP Language Strings

; Tray menu
31000="Alkalmazás lista"
31001="Példák listája"	
31002="Beállítások..."
31003="Kilépés"

31020="Gyors beállítások"
31021="Tálcaikon elrejtése"
31022="Alt-Tab cseréje"
31023="Enable Instance switcher"
31024="Alt-Tab ""kényes"" mód engedélyezése"
31025="Alacsony szintű billentyűzet hurok használata"
31026="Új kizárás..."

31050="Súgó"
31051="Dokumentáció"
31052="Honlap"
31053="TaskSwitchXP névjegye"

; Tray menu for minimized applications
31090="TSXP: %d alkalmazás(ok)"
31091="Mind visszaállítása"
31092="Mind kicsinyítése"
31093="Mind bezárása"
31094="Visszaállítás"
31095="Kicsinyítés"
31096="Bezárás"

; Task List menu
31110="Váltás ide"
31111="Kicsinyítés"
31112="Küldés a tálcára"
31113="Lépcsőzetes elrendezés"
31114="Vízszinte mozaik elrendezés"
31115="Függőleges mozaik elrendezés"
31116="Visszaállítás"
31117="Teljes méret"
31118="Bezár"
31119="Folyamat befejezése"

; Common menu
31150="Folyamat infó megjelenítése"
31151="Mind kiválasztása"
31152="Kiválasztás törlése"
31153="Kiválasztott elemek törlése"
31154="Rendezés cím alapján"
31155="Rendezés alkalmazás alapján"	

; Process Info mask
; Here are used some terms from Windows Task Manager (Ctrl+Shift+Esc, Processes ; tab, View->Select Columns...)!
; WARNING: Don't replace %x special characters!!!
31500="Kép neve:  %s\r\nFolyamat ID:  %u\r\n\r\nIdőtartam:  %u:%02u:%02u\r\nCPU Idő:  %u:%02u:%02u\r\n\r\nMemóriahasználat:  %uK\r\nVM Méret:  %uK"
31501="Nincs elérhető folyamat infó" ; Process information is not available...

; Confirmations
31900="TaskSwitchXP megerősítés"
31901="TaskSwitchXP már fut. Le akarod állítani?"
31902="Biztos vagy abban, hogy ki akarsz lépni a TaskSwitchXP-ből?"
31903="TaskSwitchXP érzékelte, hogy PowerToy TaskSwitcher kisasszony fut.\r\nLe szeretnéd állítani?"

; Errors
32000="TaskSwitchXP hiba"
32002="Értékadási hiba."
32003="Nem sikerült telepíteni az alacsony szintű hurkot."
32004="Nem sikerült regisztrálni az Alt+Tab vagy az Alt+Shift+Tab forró kulcsot.\r\nMásik alkalmazás valószínűleg már regsztrálhatta."
32005="Nem sikerült regisztrálni az Alt+Tab vagy az Alt+Shift+Tab forró kulcsot.\r\nMásik alkalmazás valószínűleg már regsztrálhatta."
32006="Nem sikerült elndítani a ConfigTsXP.exe aktát! Ellenőrizd a TaskSwitchXP telepítését."

32500="Sikertelen forró kulcs regisztrálás:\r\n\r\nNév: %s\r\n?Módosítók: %02X\r\nVirtuális kód: %02X"
32501="Kilépés a TaskSwitchXP-ből"
32502="Tálcaikon megjelenítése/elrejtése"
32503="TaskSwitchXP konfigurálása"
32504="Alkalmazások listája"
32505="Példák listája"
32506="Ablak küldése a tálcára"
32507="Visszaállítás a tálcáról"
